# Step1

## 예제 1-1  연산자와 메소드

In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.23.4'

In [2]:
ser = pd.Series([1,2,3])

In [3]:
ser

0    1
1    2
2    3
dtype: int64

In [4]:
ser + ser

0    2
1    4
2    6
dtype: int64

In [5]:
ser.add(ser)

0    2
1    4
2    6
dtype: int64

In [1]:
import pandas as pd

## 예제 1-2  검색과 슬라이싱 편리성

In [2]:
ser = pd.Series([1,2,3])

In [3]:
df = pd.DataFrame(ser)

In [4]:
df

   0
0  1
1  2
2  3

In [5]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [6]:
df.iloc[0]

0    1
Name: 0, dtype: int64

In [7]:
df.iloc[0,0]

1

In [8]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [9]:
df[0][0]

1

In [1]:
import pandas as pd

## 예제 1-3  인스턴스를 관리하는 속성

In [69]:
df = pd.DataFrame(data=[[0,1,2],[3,4,5]], index=list('ab'),
                  columns=list('cde'))

In [70]:
df

   c  d  e
a  0  1  2
b  3  4  5

In [14]:
type(df.index)

pandas.core.indexes.base.Index

In [15]:
type(df.columns)

pandas.core.indexes.base.Index

In [16]:
type(df.values)

numpy.ndarray

In [1]:
import pandas as pd

## 예제 1-4 변수에 할당

In [71]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))

In [72]:
df_a = df

In [73]:
df_a['a'] = 100

In [74]:
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [75]:
df

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [77]:
id(df),id(df_a)

(2237706011816, 2237706011816)

In [ ]:
# is : (A is B) A, B 두 객체의 주소가 같은지 확인, 같으면 True 틀리면 False

In [76]:
df.values.base is df_a.values.base

True

In [1]:
import pandas as pd

## 예제 1-5  연산을 수행할 경우 새로운 인스턴스 생성

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))

In [3]:
df_b = df + 99

In [4]:
df_b

     a    b    c
0  100  101  102
1  103  104  105
2  106  107  108

In [5]:
id(df_b), id(df)

(1538338418064, 1538301375440)

In [6]:
df_b.values.base is df.values.base

False

In [7]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
import numpy as np

In [9]:
s1 = pd.Series(index=list('abcd'), data=np.arange(4))

In [10]:
s2 = s1

In [11]:
s1 is s2

True

In [12]:
s3 = s1.copy()

In [13]:
s1 is s3

False

In [14]:
s1 is s2

True

In [15]:
s2 is s3

False

In [2]:
import pandas as pd

## 예제 1- 6 __getitem__ 이해하기

In [3]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]],index=['a','b'],
                  columns=['가','나','다','라'])

In [4]:
df

   가  나  다  라
a  1  2  3  4
b  5  6  7  8

In [5]:
df['나']

a    2
b    6
Name: 나, dtype: int64

In [6]:
df.__getitem__('나')

a    2
b    6
Name: 나, dtype: int64

In [12]:
type(df)

pandas.core.frame.DataFrame

In [7]:
ser = df['나']

In [8]:
ser

a    2
b    6
Name: 나, dtype: int64

In [9]:
ser['a']

2

In [10]:
ser.__getitem__('a')

2

In [11]:
type(ser)

pandas.core.series.Series

In [93]:
ser.__getitem__(ser > 3)

b    6
Name: 나, dtype: int64

In [94]:
df.__getitem__(df > 3)

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

In [1]:
import pandas as pd

## 예제 1-7  브로드캐스팅과 벡터화 연산

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=list('abc'))

In [3]:
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [5]:
df1 = pd.DataFrame([[3,3,3],[3,3,3],[3,3,3]],
                  columns=list('abc'))

In [6]:
df1

   a  b  c
0  3  3  3
1  3  3  3
2  3  3  3

In [7]:
df + 3

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12

In [8]:
df + df1

    a   b   c
0   4   5   6
1   7   8   9
2  10  11  12